// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Par Chrome OS Image Creator";
"Menu Prefs" = "Preferences..";
"Menu Services" = "Pakalpojumi";
"Menu Hide" = "Slēpt Chrome OS Image Creator";
"Menu Hide Others" = "Slēpt citus";
"Menu Show All" = "Rādīt visu";
"Menu Quit" = "Aizvērt Chrome OS Image Creator";
"Menu Window" = "Logs";
"Menu Minimize" = "Samazināt";
"Menu Zoom" = "Tālummainīt";
"Menu Bring All To Front" = "Pārlikt uz augšu";
"Menu Help" = "Palīdzība";
"Menu App Help" = "Chrome OS Image Creator palīdzība";

/* Buttons */
"Button Previous" = "Iepriekšējais";
"Button Next" = "Nākamais";
"Button Stop" = "Pārtraukt";
"Button Done" = "Gatavs";

/* Tab: Select device model */
"Text Welcome" = "Laipni lūgti Chrome OS Image Creator! Atlasiet izmantotās Chrome OS ierīces modeli.";
"Button Local Image" = "Vietējais attēls…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Atlasiet USB atmiņas karti, ar kuru lietotājam jāveic atkopšana:";
"Text Insertion Prompt" = "Ievietojiet USB atmiņas karti.";

/* Tab: Done */
"Text Congrats" = "Esat sekmīgi izveidojis savas Chrome OS ierīces atkopšanas disku. Izņemiet to no datora un izmantojiet, lai atkoptu Chromebook piezīmjdatora bojāto operētājsistēmu.";

/* Sizes */
"Size Bytes" = " baiti";
"Size Kilobytes" = " KB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Šo lietojumprogrammu nevar palaist.";
"NoDiskArb Informative" = "Disk Arbitration palaišanas laikā radās problēma. Tam nevajadzēja notikt.";
"NoDiskArb OK" = "Labi";

/* Error retrieving config file. */
"CantGetConfig Message" = "Nevar izgūt attēlu sarakstu.";
"CantGetConfig Informative" = "Pieejamo atkopšanas attēlu saraksta izgūšanas laikā radās problēma (%1$@). Pārbaudiet, vai darbojas tīkla savienojums.";
"CantGetConfig OK" = "Labi";
"CantGetConfig Error NoConnection" = "savienojumu nevarēja piešķirt";
"CantGetConfig Error DownloadError" = "lejupielādes laikā radās kļūda";
"CantGetConfig Error StringCreate" = "atbildi nevarēja izmantot";

/* Version error. */
"VersionError Message" = "Šī lietojumprogrammas versija ir pārāk veca.";
"VersionError Informative" = "Lejupielādējiet jaunāku versiju. Šī ir %1$@ versija; ir nepieciešama vismaz %2$@ versija. %3$@";
"VersionError OK" = "Lejupielādēt jaunu versiju";

/* File dialog to select a local file. */
"SelectLocal File" = "Atlasiet attēlu:";
"SelectLocal Button" = "Atlasīt";

/* Alert on writing stick. */
"WriteAlert Message" = "Vai tiešām vēlaties neatgriezeniski dzēst %1$@?";
"WriteAlert Informative" = "Visi tajā pašlaik glabātie dati tiks neatgriezeniski dzēsti. Šo darbību nevar atsaukt.";
"WriteAlert Cancel" = "Nedzēst";
"WriteAlert OK" = "Dzēst";

"TooSmallAlert Message" = "%1$@ nevar izmantot, jo tā ir pārāk maza.";
"TooSmallAlert Informative" = "Nepieciešama atmiņas karte ar vismaz %2$@.";
"TooSmallAlert OK" = "Labi";

"NotWritable Message" = "%1$@ nevar izmantot, jo tā ir tikai lasāma.";
"NotWritable Informative" = "Atmiņas karte ir tikai lasāma. Iespējams, uz kartes ir slēdzis, kuru nospiežot var veikt ierakstīšanu, citādi to nevar izmantot.";
"NotWritable OK" = "Labi";

/* Stick writing statuses. */
"Status Downloading" = "Notiek lejupielāde…";
"Status Verifying" = "Notiek verificēšana…";
"Status Unpacking" = "Notiek izpakošana…";
"Status Claiming" = "Notiek apstiprināšana…";
"Status Unmounting" = "Notiek atvienošana…";
"Status Writing" = "Notiek rakstīšana…";
"Status Ejecting" = "Notiek izstumšana…";
"Status Done" = "Gatavs!";

"StatusAdd Attempt" = " (%1$d mēģinājums)";

/* Errors */
"Failure Downloading" = "Diemžēl radās kļūda (neizdevās lejupielādēt avota attēlu). Vai mēģināt vēlreiz?";
"Failure Verifying Return Value" = "Diemžēl radās kļūda (neizdevās verificēt avota attēlu, programmas kļūme, %1$s). Vai mēģināt vēlreiz?";
"Failure Verifying SHA Mismatch" = "Diemžēl radās kļūda (neizdevās verificēt avota attēlu, kontrolsummas kļūme). Vai mēģināt vēlreiz?";
"Failure Unpacking" = "Diemžēl radās kļūda (neizdevās atvērt avota attēla pakotni %1$s). Vai mēģināt vēlreiz?";
"Failure Claiming" = "Diemžēl radās kļūda (neizdevās apstiprināt USB atmiņas karti). Vai mēģināt vēlreiz?";
"Failure Unmounting" = "Diemžēl radās kļūda (neizdevās atvienot USB atmiņas karti). Vai mēģināt vēlreiz?";
"Failure Opening Source Image" = "Diemžēl radās kļūda (neizdevās atvērt avota attēlu, %1$s). Vai mēģināt vēlreiz?";
"Failure Opening Destination Device" = "Diemžēl radās kļūda (neizdevās atvērt USB atmiņas karti, %1$s). Vai mēģināt vēlreiz?";
"Failure Reading Source Image" = "Diemžēl radās kļūda (neizdevās nolasīt avota attēlu, %1$s). Vai mēģināt vēlreiz?";
"Failure Writing Destination Device" = "Diemžēl radās kļūda (neizdevās ierakstīt datus USB atmiņas kartē, %1$s). Vai mēģināt vēlreiz?";
"Failure Ejecting" = "Diemžēl radās kļūda (neizdevās izstumt USB atmiņas karti). Vai mēģināt vēlreiz?";

"Failure Try Again" = "Mēģināt vēlreiz";
"Failure Quit" = "Aizvērt";

"Failure Termination Status" = "Pārtraukšanas statuss %d";

"Failure Internal Error 1" = "Negaidīta EOF kļūda";
